In [81]:
import unicodecsv

#read data from CSV file and make it to lists
def read_csv(filename):
    with open(filename, 'rb') as f:
        reader = unicodecsv.DictReader(f)
        return list(reader)

In [82]:
user = read_csv('../data_20180120/customer.csv')

In [161]:
import pandas as pd

users = pd.DataFrame(user)
users[:5]

,CUSTOMER_ID,FIRST_NAME,IS_DESIGNER,BPCODE,ADDRESS_NO,ADDRESS_POSTAL_CODE,ADDRESS_PROVINCE_ID,ADDRESS_PROVINCE,ADDRESS_STREET,ADDRESS_DISTRICT_ID,ADDRESS_DISTRICT,ADDRESS_SUB_DISTRICT_ID,ADDRESS_SUB_DISTRICT,ADDRESS_TYPE,ADDRESS_BUILDING,ADDRESS_OFFICE_NAME,DATE_OF_BIRTH
0,"2,083",ฐนันทิพย์,N,1100698858,2,20170,04090000000,จ.ชลบุรี,เซิดน้อย,04094570000,อ.บ้านบึง,04094573409,ต.บ้านบึง,บ้านพักอาศัย,เอเชีย,Cupcode,1988-10-30
1,"2,102",ทดสอบ002,N,1900036840,,,,,,,,,,,,,
2,"2,223",Ping,N,1900036887,,,,,,,,,,,,,
3,"2,224",มาศสุภา,N,1900036888,,,,,,,,,,,,,
4,"2,284",Tanate,N,1900036922,,,,,,,,,,,,,

In [79]:
users['CUSTOMER_ID'][:5]

0    2,083
1    2,102
2    2,223
3    2,224
4    2,284
Name: CUSTOMER_ID, dtype: object

In [80]:
users['DATE_OF_BIRTH'][:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [78]:
ID = users['CUSTOMER_ID']
ID[:5]

0    2,083
1    2,102
2    2,223
3    2,224
4    2,284
Name: CUSTOMER_ID, dtype: object

In [77]:
BD = users['DATE_OF_BIRTH']
BD[:5]

0    1988-10-30
1
2
3
4
Name: DATE_OF_BIRTH, dtype: object

In [38]:
result = pd.concat([ID, BD], axis=1)

In [76]:
result[:5]

  CUSTOMER_ID DATE_OF_BIRTH
0       2,083    1988-10-30
1       2,102
2       2,223
3       2,224
4       2,284

  ID & Birth

In [72]:
Id_birth = result[result['DATE_OF_BIRTH'].notnull() & (result['DATE_OF_BIRTH'] != "")]
Id_birth[:5]

   CUSTOMER_ID DATE_OF_BIRTH
0        2,083    1988-10-30
13       2,390     1986-8-11
16       2,406    1983-10-10
21       2,412    1989-10-25
22       2,413      1982-6-4

In [73]:
Id_birth.to_csv('../data_clean/customer.csv')

In [74]:
AD = users['ADDRESS_POSTAL_CODE']
AD[:5]

0    20170
1
2
3
4
Name: ADDRESS_POSTAL_CODE, dtype: object

In [75]:
results = pd.concat([ID,BD,AD], axis=1)
results[:5]

  CUSTOMER_ID DATE_OF_BIRTH ADDRESS_POSTAL_CODE
0       2,083    1988-10-30               20170
1       2,102
2       2,223
3       2,224
4       2,284

ID&Birth&address

In [70]:
df_add_not_null = results [results['ADDRESS_POSTAL_CODE'].notnull() & (results['ADDRESS_POSTAL_CODE'] != "") & (results['DATE_OF_BIRTH'].notnull() &(results['DATE_OF_BIRTH'] != ""))]


df_add_not_null[:5]

   CUSTOMER_ID DATE_OF_BIRTH ADDRESS_POSTAL_CODE
0        2,083    1988-10-30               20170
13       2,390     1986-8-11               10250
16       2,406    1983-10-10               10150
21       2,412    1989-10-25               11110
22       2,413      1982-6-4               11000

In [63]:
df_add_not_null.to_csv('../data_clean/customer.csv')

birth

In [68]:
y_m_d = df_add_not_null['DATE_OF_BIRTH']
y_m_d[:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

In [66]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2018, 2, 5, 11, 21, 7, 933253)

In [205]:
 y = now.year
y

2018

In [206]:
 y- int('1988')

30

In [207]:
from datetime import datetime

def bd_to_age(bd_str):
    datetime_ob = datetime.strptime(bd_str, '%Y-%m-%d').date()
    now = datetime.now().date()
    delta = (now - datetime_ob)
    number_of_days = delta.days
    number_of_years = number_of_days/365
    return number_of_years

In [208]:
bd_to_age('1988-10-30')

29.28767123287671

In [209]:
birth_not_null = users[users['DATE_OF_BIRTH'].notnull() &(users['DATE_OF_BIRTH'] != "")]['DATE_OF_BIRTH']
birth_not_null[0:5]

0     1988-10-30
13     1986-8-11
16    1983-10-10
21    1989-10-25
22      1982-6-4
Name: DATE_OF_BIRTH, dtype: object

Age

In [210]:
 age = birth_not_null.apply(bd_to_age)
age[:5]

0     29.287671
13    31.509589
16    34.347945
21    28.301370
22    35.698630
Name: DATE_OF_BIRTH, dtype: float64

In [211]:
birth_not_null.to_csv('../data_clean/customer.csv')

In [212]:
users_all = pd.concat([df_add_not_null,age], axis=1)
users_all[:5]

   CUSTOMER_ID  DATE_OF_BIRTH ADDRESS_POSTAL_CODE  DATE_OF_BIRTH
0        2,083     1988-10-30               20170      29.287671
13       2,390      1986-8-11               10250      31.509589
16       2,406     1983-10-10               10150      34.347945
21       2,412     1989-10-25               11110      28.301370
22       2,413       1982-6-4               11000      35.698630

In [213]:
users_all['Age'] = age

In [214]:
users_all[:5]

   CUSTOMER_ID  DATE_OF_BIRTH ADDRESS_POSTAL_CODE  DATE_OF_BIRTH        Age
0        2,083     1988-10-30               20170      29.287671  29.287671
13       2,390      1986-8-11               10250      31.509589  31.509589
16       2,406     1983-10-10               10150      34.347945  34.347945
21       2,412     1989-10-25               11110      28.301370  28.301370
22       2,413       1982-6-4               11000      35.698630  35.698630

In [215]:

del users_all['DATE_OF_BIRTH']
users_all

      CUSTOMER_ID ADDRESS_POSTAL_CODE        Age
0           2,083               20170  29.287671
13          2,390               10250  31.509589
16          2,406               10150  34.347945
21          2,412               11110  28.301370
22          2,413               11000  35.698630
24          2,416               10280  35.852055
26          2,082               11120  41.315068
27          2,142               10140  29.509589
32          2,291               12130  33.594521
36          2,316               10250  22.567123
42          2,391               11110  29.734247
52          2,426               11130  38.852055
53          2,085               10330  21.109589
57          2,229               21140  34.219178
59          2,243               11150  37.386301
63          2,264               10700  43.800000
66          2,309               10260  36.786301
73          2,392               10240  41.616438
74          2,402               11000  36.243836
75          2,405               10210  34.213699
79          2,182               24110  27.701370
84          2,233               10330  28.610959
87          2,246               10540  34.087671
93          2,305               10540  34.156164
101         2,337               10160  33.542466
104            41               10140   2.334247
105         1,042               12345   6.526027
106         2,084               20170  29.287671
119         2,365               10140  26.898630
122         2,369               10150  32.032877
...           ...                 ...        ...
36104     241,722               10900  32.323288
36106     242,002               10540  39.602740
36110     243,522               12120  23.317808
36111     243,582               67140  23.589041
36117     245,542               10150  28.706849
36119     256,762               10140  40.827397
36122     227,602               10150  28.117808
36126     232,264               10400  34.383562
36127     232,762               73000  23.898630
36132     238,842               11000  60.695890
36136     242,442               80110  36.830137
36139     243,122               50210  60.939726
36141     244,063               10150  32.619178
36145     248,702               10300  28.301370
36147     253,903               10260  28.150685
36153     257,622               73110  30.695890
36155     258,362               12120  34.769863
36157     226,543               10140  32.312329
36158     227,242               10160  37.032877
36162     229,242               11000  35.186301
36171     232,302               10310  39.471233
36175     232,804               71170  41.315068
36176     234,342               10600  29.115068
36181     231,222               10240  32.183562
36183     257,823               10220  56.205479
36184     258,302               10270  25.789041
36186     227,002               90140  31.128767
36200     239,722               20000  48.073973
36208     247,822               10170  29.890411
36209     248,022               10800  30.063014

[10594 rows x 3 columns]

In [221]:
users_all.to_csv('../data_clean/customer.csv')